#### Marble Members

---

|  |
| --- |
| Marble Class   Properties   See Also |

The  Marble  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | MarbleColor1 | The property labeled "Stone Color" from the "Marble" schema. |
| Public property Static member | MarbleColor2 | The property labeled "Vein Color" from the "Marble" schema. |
| Public property Static member | MarbleSize | The property labeled "Vein Spacing" from the "Marble" schema. |
| Public property Static member | MarbleWidth | The property labeled "Vein Width" from the "Marble" schema. |
| Public property Static member | TextureAngle | The property labeled "Angle" from the "Marble" schema. |
| Public property Static member | TextureLinkTextureTransforms | The property labeled "Link Transforms" from the "Marble" schema. |
| Public property Static member | TextureRealWorldOffsetX | The property labeled "Offset X" from the "Marble" schema. |
| Public property Static member | TextureRealWorldOffsetY | The property labeled "Offset Y" from the "Marble" schema. |
| Public property Static member | TextureRealWorldOffsetZ | The property labeled "Offset Z" from the "Marble" schema. |

# See Also

Marble Class

Autodesk.Revit.DB.Visual Namespace